app/Controllers/ArticleController.php

SELECT *
FROM `articles`
WHERE `articles`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
---
    public function index()
    {
        $data = [
            'articles' => $this->articleModel->orderBy('created_at', 'DESC')->findAll()
        ];

SELECT *
FROM `articles`
WHERE `articles`.`deleted_at` IS NULL
AND `articles`.`id` = '2'
---
    public function get($id)
    {
        $article = $this->articleModel->find($id);