app/Controllers/AuthController.php

    public function processRegister()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'username' => 'required|is_unique[users.username]',
            'password' => 'required|min_length[6]',
            'confirm_password' => 'required|matches[password]',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $userModel = new UserModel();
        $userModel->save([
            'username' => $this->request->getPost('username'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        ]);
---
INSERT INTO `users` (`username`, `password`) VALUES ('nataIT', '$2y$10$BUeEucb6OAxoN2NK45Fep.7rn1F/yvHVV3fATeKJYdkiSwxsR6gfG')

    public function processLogin()
    {
        $userModel = new UserModel();
        $user = $userModel->where('username', $this->request->getPost('username'))->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1