app/Controllers/CertifiedsController.php

    public function index()
    {
        $model = new CertifiedsModel();
        $data['certifieds'] = $model->findAll();
---
SELECT *
FROM `certifieds`