app/Controllers/ClientsController.php

    public function index()
    {
        $model = new ClientsModel();
        $data['clients'] = $model->findAll();
---
SELECT *
FROM `clients`