app/Controllers/HomeController.php

SELECT *
FROM `portfolios`
---
    public function index(): string
    {
        // Mengambil data setting pertama
        $setting = $this->settingModel->first();

        $data = [
            'portfolios' => $this->portoModel->findAll(),
            'articles' => $this->articleModel->findAll(),
            'clients'    => $this->clientsModel->findAll(),
            'certifieds' => $this->certifiedsModel->findAll(),
            'setting'    => $setting // Kirim ke view
        ];