app/Controllers/HomeController.php

    public function index(): string
    {
        $setting = $this->settingModel->first();

        // Ambil filter kategori dari query string
        $category = strtolower($this->request->getGet('category') ?? 'all');
        $page = (int)($this->request->getGet('page') ?? 1);
        $perPage = 6;

        // Query data portfolio berdasarkan kategori
        if ($category === 'all') {
            $portfolios = $this->portoModel->paginate($perPage, 'default', $page);
            $total = $this->portoModel->countAll();
        } else {
            $portfolios = $this->portoModel
                ->where('LOWER(category)', $category)
                ->paginate($perPage, 'default', $page);
            $total = $this->portoModel
                ->where('LOWER(category)', $category)
                ->countAllResults();
        }

        $data = [
            'portfolios' => $portfolios,
            'pager' => $this->portoModel->pager,
            'category' => $category,
            'perPage' => $perPage,
            'total' => $total,
            'articles' => $this->articleModel->findAll(),
            'clients' => $this->clientsModel->findAll(),
            'certifieds' => $this->certifiedsModel->findAll(),
            'setting' => $setting
        ];
---
SELECT *
FROM `settings`
 LIMIT 1
SELECT *
FROM `articles`
WHERE `articles`.`deleted_at` IS NULL
SELECT *
FROM `clients`
SELECT *
FROM `certifieds`
SELECT *
FROM `portfolios`
 LIMIT 6