app/Controllers/PortoController.php

    public function index()
    {
        $data = [
            'portfolios' => $this->portoModel->findAll(),
        ];
---
SELECT *
FROM `portfolios`